x=input('Чтобы зарегистрироваться, введите логин.\n' )
y=input('Придумайте пароль.\n')
login=x
password=y
print('Вы успешно зарегистрировались!')
print('__________________________________________________________________________________________________________________')
print('__________________________________________________________________________________________________________________')
print('Войдите в систему, чтобы получить доступ ко всем функциям.')
log=(input("Введите логин:\n"))
pas=(input("Введите пароль:\n"))
if((log==login)and(pas == password)):
	balance=0
	print('__________________________________________________________________________________________________________________')
	print('__________________________________________________________________________________________________________________')
	print("Вход выполнен успешно! У вас на счету",balance,"р.")
	while 1:
		print('__________________________________________________________________________________________________________________')
		print('__________________________________________________________________________________________________________________')
		print("Введите 1, чтобы пополнить счет, 2, чтобы снять, 3, чтобы выйти из аккаунта, и 4, чтобы узнать состояние счета.")
		s=int(input('(Далее - Enter.)\n'))
		if(s==1):
			sum=int(input("На сколько вы хотите пополнить счет? (Далее - Enter.)\n"))
			balance=balance+sum
			print("Операция проведена успешно! На Вашем счету",balance,'р.')
		if(s==2):
			print("Сколько вы желаете снять со счета?")
			sum=int(input('(Далее - Enter.)\n'))
			if (sum>balance):
				print('__________________________________________________________________________________________________________________')
				print('__________________________________________________________________________________________________________________')
				print("На счете недостаточно средств. Попробуйте ввести меньшее значение.")
			else:
				balance=balance-sum
				print("Средства сняты со счета. Остаток:",balance,"р.")
		if(s==3):
			print('__________________________________________________________________________________________________________________')
			print('__________________________________________________________________________________________________________________')
			print('Вы вышли из аккаунта.') 
			raise SystemExit
		if(s==4):
			print('__________________________________________________________________________________________________________________')
			print('__________________________________________________________________________________________________________________')
			print('На вашем счету',balance,'р.')
if((log!= login)or(pas!= password)):
	count=4
	while ((log!=login)or(pas!=password)):
		count=count-1
		print("Неправильно введён логин или пароль. Осталось попыток входа:", count)
		log=(input("Введите логин:\n"))
		pas=(input("Введите пароль:\n"))	
		if ((count < 2)and((log!=login)or(pas!=password))):
			print('Вход заблокирован в связи с ошибкой при входе.')
			break
if ((log ==login)and(pas==password)):
	
	balance=0
	print('__________________________________________________________________________________________________________________')
	print('__________________________________________________________________________________________________________________')
	print("Вход выполнен успешно! У вас на счету",balance,"р.")
	while ((balance > -1)):
		print('__________________________________________________________________________________________________________________')
		print('__________________________________________________________________________________________________________________')
		print('Введите 1, чтобы пополнить счет, 2, чтобы снять, 3, чтобы выйти из аккаунта, и 4, для того чтобы узнать состояние счета.')
		s=int(input('(Далее - Enter.)\n'))
		if(s==1):
			sum=int(input("На сколько вы хотите пополнить счет?\n"))
			balance=balance+sum
			print("Операция проведена успешно! На Вашем счету",balance,'р.')
		if(s==2):
			print("Сколько вы желаете снять со счета?")
			sum=int(input('(Далее - Enter.)\n'))
			if (sum>balance):
				print("На счете недостаточно средств. Попробуйте ввести меньшее значение.")
			else:
				balance=balance-sum
				print("Средства сняты со счета. Остаток:",balance,"р.")
		if(s==3):
			print('__________________________________________________________________________________________________________________')
			print('__________________________________________________________________________________________________________________')
			print('Вы вышли из аккаунта.')
			raise SystemExit
		if(s==4):
			print('__________________________________________________________________________________________________________________')
			print('__________________________________________________________________________________________________________________')
			print('На вашем счету',balance,'р.')
